In [13]:
import pandas as pd

data1 = [1,2,3,4,5]
series1 = pd.Series(data1)
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
data2 = {'a':[1,2,3]}
series2 = pd.Series(data2)
series2

a    [1, 2, 3]
dtype: object

In [20]:
data3 = (1,2,3,4,5)
series3 = pd.Series(data3)
series3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
print(series1[0])
print(series2[0])
print(series3[0])

1
[1, 2, 3]
1

C:\Users\userpc\AppData\Local\Temp\ipykernel_16732\3912146346.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(series2[0])

In [27]:
print(series3.index)
print(series3.values)

RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]

In [28]:
series1.index = ['a','b','c','d','e']

In [32]:
series1['a']

np.int64(1)

In [ ]:
# Series() contains informations(in list) of index & values
# pd.Series(data=data,index=index)

In [38]:
series0 = pd.Series(data=[1,2,3,4,5],index=['a','b','c','d','e'])

In [39]:
series0

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [40]:
series0.name = "name1"
series0.index.name = "name2"
series0

name2
a    1
b    2
c    3
d    4
e    5
Name: name1, dtype: int64

In [41]:
series0 > 2

name2
a    False
b    False
c     True
d     True
e     True
Name: name1, dtype: bool

In [42]:
series0[series0 > 2]

name2
c    3
d    4
e    5
Name: name1, dtype: int64

In [43]:
series0[series0 < 3]

name2
a    1
b    2
Name: name1, dtype: int64

In [44]:
series0[-(series0 > 2)]

name2
a    1
b    2
Name: name1, dtype: int64

In [84]:
data = {'name':['lee','park','kim','choi'],
        'score':[85,90,100,70],
        'grade':['B','A','A','C']}
df = pd.DataFrame(data)
# Series key of dict index DataFrame key of dict column

In [56]:
df

   name  score grade
0   lee     85     B
1  park     90     A
2   kim    100     A
3  choi     70     C

In [62]:
df = pd.DataFrame(data,columns=['name','grade','score'])

In [63]:
df

   name grade  score
0   lee     B     85
1  park     A     90
2   kim     A    100
3  choi     C     70

In [85]:
print(df.columns)
print(df.index)

print(df.values)

# DataFrame contains informations(in list) of index/values/columns
# but values are rowwise* in DataFrame

Index(['name', 'score', 'grade'], dtype='object')
RangeIndex(start=0, stop=4, step=1)
[['lee' 85 'B']
 ['park' 90 'A']
 ['kim' 100 'A']
 ['choi' 70 'C']]

In [64]:
df.index.name = 'name1'
df.columns.name = 'name2'

In [92]:
df['name']

0     lee
1    park
2     kim
3    choi
Name: name, dtype: object

In [69]:
# df['name'].values

array(['lee', 'park', 'kim', 'choi'], dtype=object)

In [101]:
df['name'][0]

'lee'

In [97]:
df.loc[0]

name     lee
score     85
grade      B
Name: 0, dtype: object

In [99]:
# df.loc[0].values

array(['lee', np.int64(85), 'B'], dtype=object)

In [98]:
df.loc[0,'name']

'lee'

In [106]:
df[:]

   name  score grade
0   lee     85     B
1  park     90     A
2   kim    100     A
3  choi     70     C

In [88]:
df.to_dict()

{'name': {0: 'lee', 1: 'park', 2: 'kim', 3: 'choi'},
 'score': {0: 85, 1: 90, 2: 100, 3: 70},
 'grade': {0: 'B', 1: 'A', 2: 'A', 3: 'C'}}

In [89]:
import numpy as np

In [90]:
array = np.array([['lee',85,'B'],['park',90,'A'],['kim',100,'A'],['choi',70,'C']])

In [91]:
array # same as df.values

array([['lee', '85', 'B'],
       ['park', '90', 'A'],
       ['kim', '100', 'A'],
       ['choi', '70', 'C']], dtype='<U21')

In [107]:
df.describe()

        score
count    4.00
mean    86.25
std     12.50
min     70.00
25%     81.25
50%     87.50
75%     92.50
max    100.00

In [114]:
df

   name  score grade
0   lee     85     B
1  park     90     A
2   kim    100     A
3  choi     70     C

In [115]:
df.index = [1,2,3,4]

In [116]:
df

   name  score grade
1   lee     85     B
2  park     90     A
3   kim    100     A
4  choi     70     C

In [155]:
df.loc[:2][['name']]

   name
1   lee
2  park

In [154]:
df.iloc[:2][['name']]

   name
1   lee
2  park

In [ ]:
# difference bewtween loc and iloc
# loc is label based index however iloc is number based index
# when slicing loc contains end O but iloc X

In [ ]:
# iloc is perfectly match with opposite []
# loc has so many difference...

In [125]:
df[['name']]
# when single [] series of columns
# when double [] series of columns in dataframe

   name
1   lee
2  park
3   kim
4  choi

In [134]:
df.iloc[[0]]

  name  score grade
1  lee     85     B

In [145]:
df

   name  score grade
1   lee     85     B
2  park     90     A
3   kim    100     A
4  choi     70     C

In [144]:
df.loc[1,'name']

'lee'

In [146]:
df.iloc[0,0]

'lee'

In [149]:
df[df['score'] > 80]

   name  score grade
1   lee     85     B
2  park     90     A
3   kim    100     A